
===========================================================================
report_checks -unconstrained
===========================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
report_checks --slack_max -0.01
============================================================================
======================= Typical Corner ===================================

No paths found.


===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================
======================= Typical Corner ===================================


max slew violations count Typical: 0
max fanout violations count Typical: 0
max cap violations count Typical: 0

===========================================================================
report_parasitic_annotation -report_unannotated
============================================================================
Found 18 unannotated drivers.
 addr[0]
 addr[1]
 addr[2]
 addr[3]
 addr[4]
 addr[5]
 clk
 cs
 din[0]
 din[1]
 din[2]
 din[3]
 din[4]
 din[5]
 din[6]
 din[7]
 rst_n
 we
Found 0 partially unannotated drivers.

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================

===========================================================================
check_setup -verbose -unconstrained_endpoints -multiple_clock -no_clock -no_input_delay -loops -generated_clocks
===========================================================================
Warning: There are 8 unconstrained endpoints.
  dout[0]
  dout[1]
  dout[2]
  dout[3]
  dout[4]
  dout[5]
  dout[6]
  dout[7]
